{
"name" : "RS Upgrades",
"icon" : "refinedstorage:upgrade",
"category" : "refstoragemanual:networking",
"pages" : [
{
"type" : "text",
"text" : "RS Upgrades are used for making your RS devices faster/more effective. By using any upgrade, the amount of energy/t that this device draws will increase."
},
{
"type" : "crafting",
"recipe" : "refinedstorage:upgrade",
"text" : "Upgrade Crafting Recipe.$(br2)The Upgrade is the base item used for every type of upgrade."
},
{
"type" : "crafting",
"recipe" : "refinedstorage:speed_upgrade",
"text" : "Speed Upgrade's Crafting Recipe.$(br2)The Speed Upgrade will increase the speed of the device that it is being inserted to."
},
{
"type" : "crafting",
"recipe" : "refinedstorage:stack_upgrade",
"text" : "Stack Upgrade's Crafting Recipe.$(br2)The Stack upgrade will improve item or fluid transfer speeds by using a whole stack instead of 1 item at a time. It can be combined with speed upgrades to let the device go to the next slot quicker."
},
{
"type" : "crafting",
"recipe" : "refinedstorage:regulator_upgrade",
"text" : "Regulator Upgrade's Crafting Recipe.$(br2)The Regulator Upgrade is an upgrade that can be inserted into an $(l:exporter)Exporter$() to keep certain items or fluids in stock in the connected inventory. It will try to"
},
{
"type" : "text",
"text" : "keep the connected inventory stocked by using items or fluids from the storage network. As soon as the upgrade is inserted, you can right click on a filtered item or fluid in the Exporter GUI to configure the amount to keep in stock. Additionally, the Regulator Upgrade can be combined with a Crafting Upgrade to start autocrafting tasks when the stock from the storage network runs out."
},
{
"type" : "crafting",
"recipe" : "refinedstorage:fortune_3_upgrade",
"text" : "Fortune Upgrade's Crafting Recipe.$(br2)The Fortune Upgrade will make the $(l:destructor)Destructor$() use a certain fortune level (depending on which Fortune Upgrade you have) on the block it is breaking."
},
{
"type" : "crafting",
"recipe" : "refinedstorage:silk_touch_upgrade",
"text" : "Silk Touch Upgrade's Crafting Recipe.$(br2)The Silk Touch Upgrade makes the Destructor use Silk Touch on the blocks that it is breaking."
},
{
"type" : "crafting",
"recipe" : "refinedstorage:crafting_upgrade",
"text" : "Crafting Upgrade's Crafting Recipe.$(br2)The Crafting Upgrade will schedule a crafting task when the item being used in a device is needed but not available."
},
{
"type" : "crafting",
"recipe" : "refinedstorage:range_upgrade",
"text" : "Range Upgrade's Crafting Recipe.$(br2)The Range Upgrade increases the range of the $(l:distance)Wireless Transmitter$()."
}
]
}